"[\n    {\n        \"question\": \"Is there a way to clear out the file upload state?\",\n        \"answer\": \"Yes, you can clear out the file upload state by using the `set_key` function or by changing some other reactive variable.\",\n        \"topic\": \"File Upload\",\n        \"integrations\": [\"solara\"],\n        \"category\": \"UI\"\n    },\n    {\n        \"question\": \"For the file upload component, if I upload a file with the same name, it doesn't trigger the upload. How can I fix this?\",\n        \"answer\": \"This behavior is expected. If you want to trigger the upload for a file with the same name, you can use a different file name or modify the code to handle this scenario.\",\n        \"topic\": \"File Upload\",\n        \"integrations\": [\"solara\"],\n        \"category\": \"UI\"\n    },\n    {\n        \"question\": \"How can I display only the files and not the folders in the file browser?\",\n        \"answer\": \"To display only the files in the file browser, you can traverse the storage directory and filter out the folders with the file hashes.\",\n        \"topic\": \"File Browser\",\n        \"integrations\": [\"solara\"],\n        \"category\": \"UI\"\n    },\n    {\n        \"question\": \"How can I update the Solara DataFrame when adding a row?\",\n        \"answer\": \"To update the Solara DataFrame when adding a row, you should create a new DataFrame with the added row and assign it to the `value` attribute of the reactive variable.\",\n        \"topic\": \"Solara DataFrame\",\n        \"integrations\": [\"solara\"],\n        \"category\": \"Data Management\"\n    },\n    {\n        \"question\": \"How can I create a control flow using OnClick in Solara?\",\n        \"answer\": \"Currently, you can create a control flow using OnClick in Solara by setting a state variable and triggering a rerender. However, this flow can be improved in the future.\",\n        \"topic\": \"Control Flow\",\n        \"integrations\": [\"solara\"],\n        \"category\": \"UI\"\n    },\n    {\n        \"question\": \"Why am I seeing the message 'A widget with mount-id=\\\"solara-main\\\" should go here' when launching my Solara application?\",\n        \"answer\": \"This message indicates that the Solara application is not properly mounted. Check your code and make sure the mount-id is correctly specified.\",\n        \"topic\": \"Solara Application\",\n        \"integrations\": [\"solara\"],\n        \"category\": \"Deployment\"\n    },\n    {\n        \"question\": \"What are the benefits of using Solara for AI/ML applications?\",\n        \"answer\": \"Solara offers benefits such as declarative UI based on state/data, reactive execution, reusability through components, and the ability to write custom widgets using underlying libraries. These features make it suitable for AI/ML applications.\",\n        \"topic\": \"Solara Benefits\",\n        \"integrations\": [\"solara\"],\n        \"category\": \"Framework\"\n    },\n    {\n        \"question\": \"Is it possible to add external libraries for Solara DataFrame?\",\n        \"answer\": \"Yes, it is possible to add external libraries for Solara DataFrame. You can try using packages like ipyaggrid or ag-grid for additional functionality.\",\n        \"topic\": \"Solara DataFrame\",\n        \"integrations\": [\"solara\", \"ipyaggrid\", \"ag-grid\"],\n        \"category\": \"Data Management\"\n    },\n    {\n        \"question\": \"Is there a different port for Solara when embedded with FastAPI?\",\n        \"answer\": \"When embedded with FastAPI, Solara uses the same port as uvicorn. There is no separate port for Solara.\",\n        \"topic\": \"Solara Integration\",\n        \"integrations\": [\"solara\", \"FastAPI\", \"uvicorn\"],\n        \"category\": \"Integration\"\n    },\n    {\n        \"question\": \"Why is Solara not loading in my Docker Image (production)?\",\n        \"answer\": \"There could be several reasons for Solara not loading in a Docker Image. Check if there is a reverse proxy or firewall rules causing the issue. Also, make sure the websocket requesting Jupyter widgets is working correctly.\",\n        \"topic\": \"Solara Deployment\",\n        \"integrations\": [\"solara\", \"Docker\", \"reverse proxy\"],\n        \"category\": \"Deployment\"\n    },\n    {\n        \"question\": \"How can I make InputText multiline in Solara?\",\n        \"answer\": \"Currently, there is no built-in support for multiline InputText in Solara. You can try using CSS or custom components to achieve multiline functionality.\",\n        \"topic\": \"InputText\",\n        \"integrations\": [\"solara\"],\n        \"category\": \"UI\"\n    }\n]"