"[\n    {\n        \"question\": \"How to deploy Solara on Flask Framework?\",\n        \"answer\": \"To deploy Solara on Flask Framework, you need to register the Solara blueprint to your Flask app. Then, you can use the `render` function from Solara to render your Solara components on your Flask route. Here is an example of how you can do it: ```python\nfrom flask import Flask\nimport solara.server.flask\n\napp = Flask(__name__)\napp.register_blueprint(solara.server.flask.blueprint, url_prefix='/solara/')\n\nimport solara_components\n\n@app.route('/')\ndef hello_world():\n    from solara import render\n    render(\n        solara_components.Page(),\n        components=solara_components,\n    )\n\nif __name__ == '__main__':\n    app.run(use_reloader=False, host='127.0.0.1', port=5000, debug=False)\n```\",\n        \"topic\" : \"Deployment\" ,\n        \"integrations\" : [\"Flask\", \"Solara\"] ,\n        \"category\" : \"Deployment\"\n    },\n    {\n        \"question\": \"How to edit cells in a table in Solara?\",\n        \"answer\": \"Currently, Solara does not support editing cells in a table directly. However, you can construct a CRUD table in Solara to edit the data. If your table has too many columns, you might need to find a way to handle it. You can also use `use_state` or `use_reactive` to work with the data iteratively.\",\n        \"topic\" : \"Data Manipulation\" ,\n        \"integrations\" : [\"Solara\"] ,\n        \"category\" : \"Data Manipulation\"\n    },\n    {\n        \"question\": \"Is there any option to slide between value into slider filtering in Solara?\",\n        \"answer\": \"Currently, Solara does not support sliding between values in slider filtering. You can only use the `<`, `>`, `<=`, `>=` operators. However, you can suggest this feature in the Solara GitHub discussions.\",\n        \"topic\" : \"Data Filtering\" ,\n        \"integrations\" : [\"Solara\"] ,\n        \"category\" : \"Data Filtering\"\n    },\n    {\n        \"question\": \"How to keep the rendering independent for multiple notebooks in Solara?\",\n        \"answer\": \"Currently, Solara does not support keeping the rendering independent for multiple notebooks. If you run multiple notebooks in the same Solara app, they might interfere with each other. However, you can suggest this feature in the Solara GitHub discussions.\",\n        \"topic\" : \"Rendering\" ,\n        \"integrations\" : [\"Solara\"] ,\n        \"category\" : \"Rendering\"\n    },\n    {\n        \"question\": \"Is it possible to run Solara on static sites?\",\n        \"answer\": \"Yes, it is possible to run Solara on static sites. You can use Pyodide and Jupyter Lite to run Solara on a static site. However, there might be some references towards Pyodide that you need to handle.\",\n        \"topic\" : \"Deployment\" ,\n        \"integrations\" : [\"Solara\", \"Pyodide\", \"Jupyter Lite\"] ,\n        \"category\" : \"Deployment\"\n    },\n    {\n        \"question\": \"Is it possible to hide the Solara logo at the bottom right?\",\n        \"answer\": \"Currently, Solara does not support hiding the logo directly. However, you can inject some CSS to remove it using the Style component.\",\n        \"topic\" : \"Customization\" ,\n        \"integrations\" : [\"Solara\"] ,\n        \"category\" : \"Customization\"\n    },\n    {\n        \"question\": \"How to update the text in the MarkdownEditor in Solara?\",\n        \"answer\": \"Currently, Solara does not support updating the text in the MarkdownEditor directly. However, you can suggest this feature in the Solara GitHub discussions.\",\n        \"topic\" : \"Text Editing\" ,\n        \"integrations\" : [\"Solara\"] ,\n        \"category\" : \"Text Editing\"\n    }\n]"