"[\n    {\n        \"question\": \"How can I deploy my Solara apps on Ploomber cloud?\",\n        \"answer\": \"You can chat with the DevRel from Ploomber who can provide some pointers. However, the specific steps are not provided in the messages.\",\n        \"topic\" : \"Deployment\" ,\n        \"integrations\" : [\"Ploomber\", \"Solara\"] ,\n        \"category\" : \"Deployment\"\n    },\n    {\n        \"question\": \"How can I save the results into AWS S3 buckets?\",\n        \"answer\": \"You can create a mechanism for storing the underlying data rather than the Reactive object directly. However, the specific steps are not provided in the messages.\",\n        \"topic\" : \"Data Storage\" ,\n        \"integrations\" : [\"AWS S3\", \"Solara\"] ,\n        \"category\" : \"Data Storage\"\n    },\n    {\n        \"question\": \"How can I save a reactive variable into a file so that I can later reload?\",\n        \"answer\": \"Currently, there is no direct way to save a reactive variable into a file. However, you can strip down the reactive values from the result dictionary and serialize.\",\n        \"topic\" : \"Data Serialization\" ,\n        \"integrations\" : [\"Solara\"] ,\n        \"category\" : \"Data Serialization\"\n    },\n    {\n        \"question\": \"How can I bind the popout to a different element such as Button / Iconbutton like for FileDownload?\",\n        \"answer\": \"Currently, there is no direct way to bind the popout to a different element. However, you can use dialogs from ipyvuetify which are not included in Solara yet.\",\n        \"topic\" : \"UI Customization\" ,\n        \"integrations\" : [\"Solara\", \"ipyvuetify\"] ,\n        \"category\" : \"UI Customization\"\n    },\n    {\n        \"question\": \"How can I make a component for Mathpix Markdown?\",\n        \"answer\": \"You can start by removing 80% of the code from the .vue file and just use the part that loads the library, and then call the JS library. However, the specific steps are not provided in the messages.\",\n        \"topic\" : \"Component Creation\" ,\n        \"integrations\" : [\"Solara\", \"Mathpix Markdown\"] ,\n        \"category\" : \"Component Creation\"\n    },\n    {\n        \"question\": \"How can I combine cross filter with map (leafmap)?\",\n        \"answer\": \"Currently, there is no direct way to combine cross filter with map. However, you can use solara.use_cross_filter(id(df)) to create a filter and then use solara.CrossFilterSelect, solara.CrossFilterSlider, and solara.CrossFilterDataFrame to interact with the filter.\",\n        \"topic\" : \"Data Filtering\" ,\n        \"integrations\" : [\"Solara\", \"leafmap\"] ,\n        \"category\" : \"Data Filtering\"\n    },\n    {\n        \"question\": \"How can I sort column from header of table in dataframe?\",\n        \"answer\": \"Currently, this feature needs to be added to the datatable component of Solara. However, the specific steps are not provided in the messages.\",\n        \"topic\" : \"Data Sorting\" ,\n        \"integrations\" : [\"Solara\"] ,\n        \"category\" : \"Data Sorting\"\n    },\n    {\n        \"question\": \"How can I redirect a user to a certain page?\",\n        \"answer\": \"Currently, there is no direct way to redirect a user to a certain page. However, you can show a popup and then, after some few seconds, redirect the user to the home page.\",\n        \"topic\" : \"Page Redirection\" ,\n        \"integrations\" : [\"Solara\"] ,\n        \"category\" : \"Page Redirection\"\n    },\n    {\n        \"question\": \"How can I add and delete columns and rows in a dataframe?\",\n        \"answer\": \"Currently, there is no direct way to add and delete columns and rows in a dataframe. However, you can use the solara.DataFrame class which has column and cell actions.\",\n        \"topic\" : \"Data Manipulation\" ,\n        \"integrations\" : [\"Solara\"] ,\n        \"category\" : \"Data Manipulation\"\n    },\n    {\n        \"question\": \"How can I share data among users?\",\n        \"answer\": \"If you mutate data per 'user', don't share it. If you only use it to display something, share it. You can use solara.cache.storage['my-key'] to share data between different sessions.\",\n        \"topic\" : \"Data Sharing\" ,\n        \"integrations\" : [\"Solara\"] ,\n        \"category\" : \"Data Sharing\"\n    }\n]"